"""ХРАНЯТСЯ ПЕРЕМЕННЫЕ С ТЕКСТАМИ"""


"""ТЕКСТ для /start"""
text_start = """ПРИВЕТСТВУЮ, ДРУГ! 👋
\n
Я - InfoVerseBot, твой верный спутник в мире информации! Я готов помочь тебе узнать погоду, перевести текст, найти интересные факты в Википедии, и многое другое. Воспользуйся моими командами, чтобы расширить свой универсум:
\n\n
🌤️ ифи погода Москва - Узнай текущую погоду в любом городе.\n
🌍 ифи переведи на немецкий: текст... - Переведи текст на другой язык. (англ, ру, немец)\n
📚 ифи вики: запрос... - Найди информацию в Википедии.\n
📬 ифи ошибка: причина... - Отправь мне свои отзывы и предложения.\n
🎲 ифи ролл - Подкинет кости, для решения.\n
ℹ️ ифи команды - Получи список всех доступных команд.\n
\n
Просто набери одну из команд, и я помогу тебе разгадать тайны мира информации! Если у тебя есть вопросы или нужна помощь, не стесняйся обращаться. Для начала, давай начнем с "ифи команды". Приятно познакомиться! 🤖✨
"""


"""ТЕКСТ для КОМАНДЫ"""

text_wrong_input = '''😅 Ой, я не совсем понял Ваш запрос. Уточните, правильно ли Вы написали команду.

🔍 Могу предложить использовать команду "ифи команды", чтобы проверить правильность написания.

Будьте внимательней! ❤️
'''

text_help = '''Хорошо! Вот список команд:

🌤️ "ИФИ погода Москва" - Узнай текущую погоду в любом городе.\n
🌤️ "ИФИ погода на завтра Москва" - Узнай погоду на завтра в любом городе.\n
🌍 "ИФИ переведи на немецкий/английский/русский: текст..." - Переведи текст на другой язык. (англ, рус, нем)\n
📚 "ИФИ вики: запрос..." - Найди информацию в Википедии.\n
📬 "ИФИ ошибка: причина..." - Отправь мне свои отзывы и предложения.\n
🎲 "ИФИ ролл" - Подкинет кости для решения.\n
ℹ️ "ИФИ команды" - Получи список всех доступных команд.\n
Приятного пользования! ❤️
'''












